cmsis-svd/cmsis-svd/data/Microchip/ATSAMD51G.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HMATRIX</name>
      <version>2.1.4</version>
      <description>HSB Matrix</description>
      <groupName>HMATRIXB</groupName>
      <prependToName>HMATRIXB_</prependToName>
      <baseAddress>0x4100C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x180</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>PRAS%s</name>
          <description>Priority A for Slave</description>
          <addressOffset>0x080</addressOffset>
          <size>32</size>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>PRBS%s</name>
          <description>Priority B for Slave</description>
          <addressOffset>0x084</addressOffset>
          <size>32</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ICM</name>
      <version>1.2.0</version>
      <description>Integrity Check Monitor</description>
      <groupName>ICM</groupName>
      <prependToName>ICM_</prependToName>
      <baseAddress>0x42002C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ICM</name>
        <value>132</value>
      </interrupt>
      <registers>
        <register>
          <name>CFG</name>
          <description>Configuration</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WBDIS</name>
              <description>Write Back Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOMDIS</name>
              <description>End of Monitoring Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLBDIS</name>
              <description>Secondary List Branching Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BBC</name>
              <description>Bus Burden Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ASCD</name>
              <description>Automatic Switch To Compare Digest</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DUALBUFF</name>
              <description>Dual Input Buffer</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UIHASH</name>
              <description>User Initial Hash Value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UALGO</name>
              <description>User SHA Algorithm</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>UALGOSelect</name>
                <enumeratedValue>
                  <name>SHA1</name>
                  <description>SHA1 Algorithm</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA256</name>
                  <description>SHA256 Algorithm</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA224</name>
                  <description>SHA224 Algorithm</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAPROT</name>
              <description>Region Hash Area Protection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DAPROT</name>
              <description>Region Descriptor Area Protection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Control</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>ICM Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DISABLE</name>
              <description>ICM Disable Register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REHASH</name>
              <description>Recompute Internal Hash</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RMDIS</name>
              <description>Region Monitoring Disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RMEN</name>
              <description>Region Monitoring Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>ICM Controller Enable Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAWRMDIS</name>
              <description>RAW Region Monitoring Disabled Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RMDIS</name>
              <description>Region Monitoring Disabled Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RHC</name>
              <description>Region Hash Completed Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RDM</name>
              <description>Region Digest Mismatch Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RBE</name>
              <description>Region Bus Error Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RWC</name>
              <description>Region Wrap Condition detected Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>REC</name>
              <description>Region End bit Condition Detected Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RSU</name>
              <description>Region Status Updated Interrupt Disable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>URAD</name>
              <description>Undefined Register Access Detection Interrupt Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Interrupt Disable</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RHC</name>
              <description>Region Hash Completed Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RDM</name>
              <description>Region Digest Mismatch Interrupt Disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RBE</name>
              <description>Region Bus Error Interrupt Disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RWC</name>
              <description>Region Wrap Condition Detected Interrupt Disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>REC</name>
              <description>Region End bit Condition detected Interrupt Disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RSU</name>
              <description>Region Status Updated Interrupt Disable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>URAD</name>
              <description>Undefined Register Access Detection Interrupt Disable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RHC</name>
              <description>Region Hash Completed Interrupt Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RDM</name>
              <description>Region Digest Mismatch Interrupt Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RBE</name>
              <description>Region Bus Error Interrupt Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RWC</name>
              <description>Region Wrap Condition Detected Interrupt Mask</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>REC</name>
              <description>Region End bit Condition Detected Interrupt Mask</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RSU</name>
              <description>Region Status Updated Interrupt Mask</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>URAD</name>
              <description>Undefined Register Access Detection Interrupt Mask</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt Status</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RHC</name>
              <description>Region Hash Completed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RDM</name>
              <description>Region Digest Mismatch</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RBE</name>
              <description>Region Bus Error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RWC</name>
              <description>Region Wrap Condition Detected</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>REC</name>
              <description>Region End bit Condition Detected</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RSU</name>
              <description>Region Status Updated Detected</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>URAD</name>
              <description>Undefined Register Access Detection Status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UASR</name>
          <description>Undefined Access Status</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>URAT</name>
              <description>Undefined Register Access Trace</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>URATSelect</name>
                <enumeratedValue>
                  <name>UNSPEC_STRUCT_MEMBER</name>
                  <description>Unspecified structure member set to one detected when the descriptor is loaded</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFG_MODIFIED</name>
                  <description>CFG modified during active monitoring</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSCR_MODIFIED</name>
                  <description>DSCR modified during active monitoring</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HASH_MODIFIED</name>
                  <description>HASH modified during active monitoring</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ_ACCESS</name>
                  <description>Write-only register read access</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSCR</name>
          <description>Region Descriptor Area Start Address</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DASA</name>
              <description>Descriptor Area Start Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH</name>
          <description>Region Hash Area Start Address</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HASA</name>
              <description>Hash Area Start Address</description>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>UIHVAL%s</name>
          <description>User Initial Hash Value n</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>Initial Hash Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
