cmsis-svd/cmsis-svd/data/Microchip/ATSAMD51G.svd
        <register>
          <name>BGCR_EMMC</name>
          <description>Block Gap Control</description>
          <alternateRegister>BGCR</alternateRegister>
          <addressOffset>0x02A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>STPBGR</name>
              <description>Stop at Block Gap Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>STPBGRSelect</name>
                <enumeratedValue>
                  <name>TRANSFER</name>
                  <description>Transfer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONTR</name>
              <description>Continue Request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CONTRSelect</name>
                <enumeratedValue>
                  <name>GO_ON</name>
                  <description>Not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESTART</name>
                  <description>Restart</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WCR</name>
          <description>Wakeup Control</description>
          <addressOffset>0x02B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>WKENCINT</name>
              <description>Wakeup Event Enable on Card Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WKENCINTSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKENCINS</name>
              <description>Wakeup Event Enable on Card Insertion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WKENCINSSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKENCREM</name>
              <description>Wakeup Event Enable on Card Removal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WKENCREMSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>Clock Control</description>
          <addressOffset>0x02C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>INTCLKEN</name>
              <description>Internal Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>INTCLKENSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Stop</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Oscillate</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTCLKS</name>
              <description>Internal Clock Stable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>INTCLKSSelect</name>
                <enumeratedValue>
                  <name>NOT_READY</name>
                  <description>Not Ready</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>Ready</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDCLKEN</name>
              <description>SD Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SDCLKENSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKGSEL</name>
              <description>Clock Generator Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CLKGSELSelect</name>
                <enumeratedValue>
                  <name>DIV</name>
                  <description>Divided Clock Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG</name>
                  <description>Programmable Clock Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USDCLKFSEL</name>
              <description>Upper Bits of SDCLK Frequency Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SDCLKFSEL</name>
              <description>SDCLK Frequency Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TCR</name>
          <description>Timeout Control</description>
          <addressOffset>0x02E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DTCVAL</name>
              <description>Data Timeout Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRR</name>
          <description>Software Reset</description>
          <addressOffset>0x02F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRSTALL</name>
              <description>Software Reset For All</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SWRSTALLSelect</name>
                <enumeratedValue>
                  <name>WORK</name>
                  <description>Work</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRSTCMD</name>
              <description>Software Reset For CMD Line</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SWRSTCMDSelect</name>
                <enumeratedValue>
                  <name>WORK</name>
                  <description>Work</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRSTDAT</name>
              <description>Software Reset For DAT Line</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SWRSTDATSelect</name>
                <enumeratedValue>
                  <name>WORK</name>
                  <description>Work</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NISTR</name>
          <description>Normal Interrupt Status</description>
          <addressOffset>0x030</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CMDC</name>
              <description>Command Complete</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CMDCSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No command complete</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Command complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRFC</name>
              <description>Transfer Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TRFCSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Not complete</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Command execution is completed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLKGE</name>
              <description>Block Gap Event</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BLKGESelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Block Gap Event</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Transaction stopped at block gap</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAINT</name>
              <description>DMA Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DMAINTSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No DMA Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>DMA Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BWRRDY</name>
              <description>Buffer Write Ready</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BWRRDYSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Not ready to write buffer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Ready to write buffer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRDRDY</name>
              <description>Buffer Read Ready</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BRDRDYSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Not ready to read buffer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Ready to read buffer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CINS</name>
              <description>Card Insertion</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CINSSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Card state stable or Debouncing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Card inserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CREM</name>
              <description>Card Removal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CREMSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Card state stable or Debouncing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Card Removed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CINT</name>
              <description>Card Interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>CINTSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Card Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Generate Card Interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERRINT</name>
              <description>Error Interrupt</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>ERRINTSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
