cmsis-svd/cmsis-svd/data/Microchip/ATSAMD51G.svd
        <register>
          <name>FEREIS</name>
          <description>Force Event for Error Interrupt Status</description>
          <addressOffset>0x052</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CMDTEO</name>
              <description>Force Event for Command Timeout Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CMDTEOSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDCRC</name>
              <description>Force Event for Command CRC Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CMDCRCSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDEND</name>
              <description>Force Event for Command End Bit Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CMDENDSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDIDX</name>
              <description>Force Event for Command Index Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CMDIDXSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATTEO</name>
              <description>Force Event for Data Timeout Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DATTEOSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATCRC</name>
              <description>Force Event for Data CRC Error</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DATCRCSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATEND</name>
              <description>Force Event for Data End Bit Error</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DATENDSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURLIM</name>
              <description>Force Event for Current Limit Error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CURLIMSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMD</name>
              <description>Force Event for Auto CMD Error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ACMDSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADMA</name>
              <description>Force Event for ADMA Error</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ADMASelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOTAE</name>
              <description>Force Event for Boot Acknowledge Error</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BOOTAESelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AESR</name>
          <description>ADMA Error Status</description>
          <addressOffset>0x054</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ERRST</name>
              <description>ADMA Error State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>ERRSTSelect</name>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>ST_STOP (Stop DMA)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDS</name>
                  <description>ST_FDS (Fetch Descriptor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TFR</name>
                  <description>ST_TFR (Transfer Data)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LMIS</name>
              <description>ADMA Length Mismatch Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LMISSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>1</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ASAR%s</name>
          <description>ADMA System Address n</description>
          <addressOffset>0x058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADMASA</name>
              <description>ADMA System Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x2</dimIncrement>
          <name>PVR%s</name>
          <description>Preset Value n</description>
          <addressOffset>0x060</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>SDCLKFSEL</name>
              <description>SDCLK Frequency Select Value for Initialization</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CLKGSEL</name>
              <description>Clock Generator Select Value for Initialization</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CLKGSELSelect</name>
                <enumeratedValue>
                  <name>DIV</name>
                  <description>Host Controller Ver2.00 Compatible Clock Generator (Divider)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG</name>
                  <description>Programmable Clock Generator</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRVSEL</name>
              <description>Driver Strength Select Value for Initialization</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DRVSELSelect</name>
                <enumeratedValue>
                  <name>B</name>
                  <description>Driver Type B is Selected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>Driver Type A is Selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>Driver Type C is Selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Driver Type D is Selected</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SISR</name>
          <description>Slot Interrupt Status</description>
          <addressOffset>0x0FC</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x20000</resetValue>
          <fields>
            <field>
              <name>INTSSL</name>
              <description>Interrupt Signal for Each Slot</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HCVR</name>
          <description>Host Controller Version</description>
          <addressOffset>0x0FE</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x1802</resetValue>
          <fields>
            <field>
              <name>SVER</name>
              <description>Spec Version</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>VVER</name>
              <description>Vendor Version</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC1R</name>
          <description>MMC Control 1</description>
          <addressOffset>0x204</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CMDTYP</name>
              <description>e.MMC Command Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CMDTYPSelect</name>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Not a MMC specific command</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITIRQ</name>
                  <description>Wait IRQ Command</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STREAM</name>
                  <description>Stream Command</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT</name>
                  <description>Boot Command</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DDR</name>
              <description>e.MMC HSDDR Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPD</name>
              <description>e.MMC Open Drain Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOTA</name>
              <description>e.MMC Boot Acknowledge Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTN</name>
              <description>e.MMC Reset Signal</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCD</name>
              <description>e.MMC Force Card Detect</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC2R</name>
          <description>MMC Control 2</description>
          <addressOffset>0x205</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SRESP</name>
              <description>e.MMC Abort Wait IRQ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABOOT</name>
              <description>e.MMC Abort Boot</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACR</name>
          <description>AHB Control</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BMAX</name>
              <description>AHB Maximum Burst</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>BMAXSelect</name>
                <enumeratedValue>
                  <name>INCR16</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR4</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CC2R</name>
          <description>Clock Control 2</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FSDCLKD</name>
              <description>Force SDCK Disabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FSDCLKDSelect</name>
                <enumeratedValue>
                  <name>NOEFFECT</name>
                  <description>No effect</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CACR</name>
          <description>Capabilities Control</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAPWREN</name>
              <description>Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEY</name>
              <description>Key (0x46)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGR</name>
          <description>Debug</description>
          <addressOffset>0x234</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>NIDBG</name>
              <description>Non-intrusive debug enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>NIDBGSelect</name>
                <enumeratedValue>
                  <name>IDBG</name>
                  <description>Debugging is intrusive (reads of BDPR from debugger are considered and increment the internal buffer pointer)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NIDBG</name>
                  <description>Debugging is not intrusive (reads of BDPR from debugger are discarded and do not increment the internal buffer pointer)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
